# CanTotal Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..CanTotal Method
ScheduleField Class See Also
---
Indicates if totals can be enabled for this field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool CanTotal()
```

Visual Basic
---
```text
Public Function CanTotal As Boolean
```

Visual C++
---
```text
public:
bool CanTotal()
```

# ### Return Value
True if this field can be totaled, false otherwise.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace